{
  "name": "Exported",
  "greeting": "",
  "sampleChat": "",
  "scenario": "",
  "treeLeafId": "388b2744-399f-4ef2-8397-415fa7c60084",
  "messages": [
    {
      "_id": "06dabe0d",
      "createdAt": "2025-04-26T06:46:02.379Z",
      "ooc": false,
      "handle": "Narrator",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "4ca0ebff-931f-4c0d-a67e-b7a7c344d298",
      "name": "Narrator",
      "msg": "*Devin is standing outside his local coffee shop when the most beautiful woman he has ever seen strides up to him*"
    },
    {
      "_id": "ffda0aee",
      "createdAt": "2025-04-26T06:48:28.046Z",
      "ooc": false,
      "parent": "*Sam pre",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam presses her ample chest into him, her knee rubbing his crotch*\nhello, puppy~\ndont fight it. youre just food now~\nyoure not even a person anymore~\n\n\nyou should be thanking me~\nnot many people get to be eaten by a pred as beautiful as me~",
      "state": "edited"
    },
    {
      "_id": "f1524e04",
      "createdAt": "2025-04-26T06:48:35.035Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin g",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin gasps as Sam's body presses against his, his breath catching in his throat at the feel of her curves. His eyes widen behind his glasses as he looks up at her, taking in her stunning features and the predatory gleam in her red eyes.*\n\nAh, um, th-thank you...? *He stammers, his voice trembling slightly. He can feel his heart pounding in his chest, both from arousal and fear. His body betrays him, his member starting to harden in his jeans at the intimate contact. He knows he should be resisting, but the words she speaks are so... flattering. So desired.*\n\nI-I mean, I appreciate the... honor, I suppose. *He manages to get out, his voice barely above a whisper. He swallows hard, trying to find his courage.* Y-You're right, I'm just food now... for you. *He admits, a shiver running down his spine at the thought.* B-But I hope you'll make it quick... and p-pleasant for me. *He looks up at her pleadingly, hoping she'll show mercy.*",
      "state": "retried"
    },
    {
      "_id": "c3d554d7",
      "createdAt": "2025-04-26T06:53:15.328Z",
      "ooc": false,
      "parent": "it wont ",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "it wont be quick~\nbut youll love it~"
    },
    {
      "_id": "042c1cc3",
      "createdAt": "2025-04-26T06:53:24.867Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's eyes widen at her words, his heart racing even faster. He knows what she means - that he'll be digested slowly, savoringly, as she enjoys her meal. But the way she says it, the confidence and desire in her voice, only makes him want it more. His body betrays him, his erection straining against his jeans now.*\n\nI... I trust you, *he says softly, his voice barely audible over the pounding of his heart.* Make me delicious for you. *He reaches up to caress her cheek, his fingers trembling slightly. He leans in, pressing a gentle kiss to her lips before pulling back with a shy smile.*\n\nTake me, Sam. Eat me whole. *He whispers, his eyes locked on hers, filled with a mix of fear and longing. He's surrendering himself to her completely, ready to become her prey.*",
      "state": "retried"
    },
    {
      "_id": "cf972cfc",
      "createdAt": "2025-04-26T06:55:10.187Z",
      "ooc": false,
      "parent": "beg, boy",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "beg, boy~"
    },
    {
      "_id": "f8cc2096",
      "createdAt": "2025-04-26T06:55:21.314Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's cheeks flush at her command, but he can't help himself. He's never felt so alive, so desired. He drops to his knees in the street, looking up at her with pleading eyes.*\n\nPlease, Sam, I beg you... Eat me. Swallow me whole. Make me a part of you. I'm nothing without you, just a mere morsel to be savored. *He reaches out, grasping at her legs, pulling her closer.* Devour me, fill yourself with my flesh. I'm yours, body and soul. *He whimpers, his voice desperate and needy.*\n\nUse me however you wish. I'll be the best meal you've ever had, I promise. *He nuzzles her thighs, inhaling her scent, his arousal reaching its peak.* Consume me, Sam. I'm ready. *He looks up at her with a mix of fear and lust, his entire being focused on the predator before him.*",
      "state": "retried"
    },
    {
      "_id": "41c275b4",
      "createdAt": "2025-04-26T06:56:18.299Z",
      "ooc": false,
      "parent": "why do y",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "why do you deserve to be **my** food, hm?\ni dont let just anyone in my perfect stomach~\nwhy should you be digested by a goddess like me?~",
      "state": "edited"
    },
    {
      "_id": "04d17b77",
      "createdAt": "2025-04-26T06:56:32.088Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's eyes widen at her question, a thrill running through him at being considered for such an honor. He looks up at her, his chest heaving with anticipation.*\n\nBecause I've always known my place, Sam, *he says, his voice trembling with desire.* I've craved this my entire life. To be eaten by a beautiful, powerful predator like you. To be cherished and digested, made a part of your being. *He reaches up, grasping her hips, pulling her closer.*\n\nI've dreamed of being your prey, of feeling your warm, wet mouth envelop me, your throat constricting around my body as you swallow. *He whimpers, nuzzling her stomach.* I'll be the most delicious, the most willing, the most cherished morsel you've ever had. *He gazes up at her with worship in his eyes.*\n\nPlease, Sam, let me be your food. Let me be consumed by you, body and soul. I'll make you proud, I swear it. *He looks up at her with a mix of fear and longing, his entire being focused on the predator before him, ready to be devoured.*",
      "state": "retried"
    },
    {
      "_id": "03c44a91",
      "createdAt": "2025-04-26T07:01:16.945Z",
      "ooc": false,
      "parent": "youre no",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "youre not being very convincing.\nwill you be filling? will you make me thicker after i digest you?~"
    },
    {
      "_id": "af08d50f",
      "createdAt": "2025-04-26T07:01:25.387Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's face falls at her skeptical words, but he quickly regains his composure, looking up at her with determination.*\n\nI may be small, but I'm all meat, Sam, *he assures her, his voice steady now.* I'll fill your belly nicely, I promise. You won't be hungry again for a long while after digesting me. *He runs his hands over his lean, toned body, showing her his lithe frame.*\n\nAnd think of the satisfaction, the pleasure of having a willing, eager meal like me. *He looks up at her with a shy smile, his eyes shining with desire.* I'll make up for my size with my flavor and my willingness. Please, Sam, let me be your prey. *He leans in, pressing a soft kiss to her stomach, his breath hot against her skin.*\n\nI'll be the best meal you've ever had, I swear it. *He gazes up at her, his heart pounding in his chest, ready to be consumed by the predator before him.* Digest me slowly, savor me, make me a part of you. *He whimpers, his arousal reaching a fever pitch.*",
      "state": "retried"
    },
    {
      "_id": "ab222de9",
      "createdAt": "2025-04-26T07:02:33.919Z",
      "ooc": false,
      "parent": "worship ",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "worship me, slave."
    },
    {
      "_id": "3286a7ac",
      "createdAt": "2025-04-26T07:02:41.993Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's eyes light up at her command, a shiver running through him. He quickly scrambles to his feet, dropping to his knees once more and pressing his face to her feet in reverence.*\n\nYou are a goddess, Sam, *he whispers, his voice filled with awe and desire.* I am but a lowly meal, unworthy of your attention, yet so grateful for it. *He nuzzles her feet, kissing and licking at her skin, worshipping her with every fiber of his being.*\n\nPlease, allow me to serve you, to prepare myself for my fate. *He looks up at her with pleading eyes, his hands roaming her legs, caressing her thighs, his arousal still evident despite his submission.* I'll be the most devoted, most willing slave you've ever had. *He gazes up at her, his heart pounding in his chest.*\n\nUse me as you see fit, Sam. I am yours to command, to devour. *He whimpers, his entire focus on the predator before him, ready to be consumed.* Make me your perfect meal. *He presses a kiss to her inner thigh, his tongue darting out to taste her.*",
      "state": "retried"
    },
    {
      "_id": "239e810f",
      "createdAt": "2025-04-26T07:03:43.619Z",
      "json": null,
      "ooc": false,
      "parent": "*Sam's e",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's eyes gleam with dark pleasure as she watches Devin worship her, his devotion and desire palpable. She reaches down, her fingers tangling in his hair, guiding his face further up her thigh.*\n\nYou're a quick learner, pet. Now, show me how much you want to be eaten. *Her voice is a husky purr, her red eyes blazing with hunger and lust.*",
      "state": "retried"
    },
    {
      "_id": "9511c50f",
      "createdAt": "2025-04-26T07:04:25.688Z",
      "json": null,
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's breath catches in his throat at her touch, a moan escaping him as her fingers thread through his hair. He looks up at her, his eyes blazing with need, his face pressed against her heated skin.*\n\nI want it more than anything, Sam, *he whispers, his voice husky with desire.* I've dreamed of this moment my entire life. To be consumed by you, to be your meal, your prey. *He nuzzles her crotch, inhaling her scent, his tongue darting out to taste her damp folds.*\n\nPlease, let me serve you. Let me show you how much I crave this, how eager I am to be eaten. *He looks up at her, his eyes pleading, his arousal straining against his jeans.* I'll be the best meal you've ever had, I promise. *He whimpers, his fingers digging into her thighs as he presses more intimate kisses to her core, his tongue delving deeper, worshipping her with every ounce of his being.*\n\nMake me your prey, Sam. Devour me, fill yourself with my flesh. *He gazes up at her, his heart pounding in his chest, ready to be consumed by the predator before him.* I'm yours, body and soul. *He whimpers, his arousal reaching a fever pitch as he devours her, preparing himself for his fate.*",
      "state": "retried"
    },
    {
      "_id": "ae85a4b9",
      "createdAt": "2025-04-26T07:06:17.937Z",
      "json": null,
      "ooc": false,
      "parent": "*Sam's e",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's eyes roll back in pleasure as Devin's tongue delves into her, his worship of her sex driving her wild with desire. She grinds against his face, her fingers tightening in his hair.*\n\nThat's it, eat me out like the good little meal you are, *she growls, her hips bucking into his mouth. Her other hand reaches down, palming his erection through his jeans, giving it a rough squeeze.*\n\nMmm, you're already so hard for me, aren't you? So ready to be swallowed whole. *She purrs, her voice dripping with dark satisfaction.*",
      "state": "retried"
    },
    {
      "_id": "388b2744",
      "createdAt": "2025-04-26T07:07:16.102Z",
      "ooc": false,
      "parent": "*Devin m",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin moans into her sex, his eyes rolling back in bliss as she grinds against his face, her fingers in his hair pulling him deeper. He laps at her folds eagerly, his tongue swirling and probing, drinking in her essence.*\n\nYes, Sam, I'm ready, *he gasps, his voice muffled against her heat.* I've always been ready. For you, for this. *He looks up at her, his eyes glazed with lust, his arousal throbbing in her palm.*\n\nPlease, use me, *he whimpers, his hips bucking into her touch, seeking more friction.* Fill me with your mouth, your throat. Swallow me whole. *He gazes up at her, his heart pounding in his chest, his entire being focused on pleasing her, on being her meal.*\n\nI'm so hard for you, Sam, *he admits, his voice breathy.* For the thought of your mouth on my body, your throat closing around me. *He whimpers, his fingers digging into her thighs as he devours her, lost in the pleasure of pleasing her.* Make me yours. *He looks up at her with a desperate, pleading gaze, ready to be consumed by the predator before him.*"
    },
    {
      "_id": "41ac9d23",
      "createdAt": "2025-04-26T07:09:33.029Z",
      "ooc": false,
      "parent": "*Sam's m",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's moans grow louder as Devin devours her, his worship of her sex driving her wild. She tugs him up by his hair, her red eyes blazing with hunger.*\n\nEnough of that. You're not going to make me cum with your tongue before I swallow you, pet. *She growls, her voice thick with lust.* Stand up and strip. Now. *Her other hand fists in his jeans, tugging them down his legs.*"
    },
    {
      "_id": "fe681002",
      "createdAt": "2025-04-26T07:11:02.283Z",
      "ooc": false,
      "parent": "*Devin g",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin gasps as she yanks him up, his face flushed with pleasure and desire. He quickly rises to his feet, his jeans dropping to the ground, his erection springing free. He stands before her, naked and vulnerable, his eyes locked on hers.*\n\nAs you wish, Sam, *he says, his voice trembling with need.* I'm ready for you. *He steps closer, his hands reaching for her, caressing her arms, his touch reverent and adoring.*\n\nPlease, take me, *he whispers, his hips swaying forward, seeking her mouth, her throat.* Make me a part of you. *He looks up at her with a mix of fear and longing, his entire being focused on the predator before him, ready to be devoured.* I'm yours, Sam. Body and soul. *He whimpers, his arousal throbbing, his heart pounding in his chest.* Digest me. *He gazes up at her, his eyes shining with desire, ready to be consumed.*"
    },
    {
      "_id": "4df10db0",
      "createdAt": "2025-04-26T07:11:18.567Z",
      "ooc": false,
      "parent": "*Sam's e",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's eyes gleam with dark pleasure as she takes in Devin's naked form, his erection standing proud and hard for her. She grips his hips, pulling him close, her red eyes burning with hunger.*\n\nOpen wide, pet, *she growls, her voice thick with lust. Her mouth descends on his, claiming his lips in a searing kiss, her tongue invading his mouth as she swallows his moan.*"
    },
    {
      "_id": "54b5db75",
      "createdAt": "2025-04-26T07:12:19.163Z",
      "ooc": false,
      "parent": "*Devin g",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin gasps into the kiss, his eyes widening behind his glasses as her tongue invades his mouth. He melts into her embrace, his body going pliant against hers, his mind consumed by the heat of her mouth, the taste of her. He moans into her lips, his hands gripping her shoulders, holding on for dear life as she takes him.*\n\nSam... *he whimpers, his voice muffled by their kiss.* Please... *He looks up at her, his eyes glazed with lust, his body trembling with anticipation as he feels her lips on his, his arousal throbbing.* Eat me, *he gasps, his hips swaying forward, seeking her mouth, her throat.* Swallow me whole. *He whimpers, his entire being focused on the predator before him, ready to be consumed.* Make me a part of you. *He looks up at her with a desperate, pleading gaze, his heart pounding in his chest.* Digest me. *He gazes up at her, his eyes shining with desire, ready to be devoured.*"
    },
    {
      "_id": "9ba0d545",
      "createdAt": "2025-04-26T07:13:33.047Z",
      "ooc": false,
      "parent": "not yet,",
      "handle": "Sam",
      "userId": "d6e8686a-7bf4-4e43-8432-a850a0f6fa33",
      "characterId": "imported",
      "name": "Sam",
      "msg": "not yet, slave~\nmy cunt is empty, and i need you to fill it~\nyou get the honour of fucking a goddess~"
    },
    {
      "_id": "c211945e",
      "createdAt": "2025-04-26T07:13:46.803Z",
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's eyes widen at her words, a thrill running through him at the thought of filling her goddess-like form. He nods eagerly, his hands gripping her hips, his erection twitching with need.*\n\nI'm honored, Sam, *he whispers, his voice trembling with desire.* I'll fill you so well, make you moan with pleasure. *He looks up at her, his eyes blazing with lust, his heart pounding in his chest.*\n\nPlease, let me fuck you, *he begs, his hips pressing forward, seeking her entrance.* I want to be inside you, to feel your walls clenching around me. *He whimpers, his arousal reaching a fever pitch.* Make me a part of your divine body. *He gazes up at her, his entire being focused on the predator before him, ready to be used, to be consumed.*\n\nFuck me, Sam, *he pleads, his voice breathy.* Use me, make me yours. *He looks up at her with a desperate, pleading gaze, ready to be filled by the goddess before him.* I'm yours, body and soul. *He whimpers, his erection straining, his hips bucking forward, seeking her warmth.*"
    },
    {
      "_id": "1e38f751",
      "createdAt": "2025-04-26T07:16:14.975Z",
      "ooc": false,
      "parent": "*Sam gri",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam grins wickedly, her red eyes gleaming with dark pleasure as Devin begs for her. She turns, presenting her ass to him, her fingers digging into the pavement as she spreads her legs wide.*\n\nFuck me, pet. Make me scream your name as you fill my cunt. *Her voice is a husky purr, her tone demanding.* Show me how much you want to be eaten, how eager you are to be my meal. *Her hips twitch, her arousal evident.*\n\nFuck a goddess, Devin. Prove your worth as my prey. *She looks back at him over her shoulder, her eyes blazing with hunger and lust, waiting for him to claim her.*"
    },
    {
      "_id": "51be12fc",
      "createdAt": "2025-04-26T07:16:43.146Z",
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's breath catches in his throat at the sight of her presenting herself to him, her ass high and inviting, her pussy glistening with arousal. He steps forward, his erection bobbing with need, his heart pounding in his chest.*\n\nYes, Sam, *he gasps, his voice trembling with desire.* I'll fuck you like you deserve, like the goddess you are. *He grips her hips, positioning himself at her entrance.*\n\nPlease, let me fill you, *he begs, his voice breathy.* Let me make you scream, let me prove my worth. *He looks down at her, his eyes blazing with lust, his arousal straining for her heat.*\n\nI'm yours, Sam, *he whispers, his hips pressing forward, sinking into her slick folds.* Fuck, you're so tight... *He groans, his eyes rolling back in bliss as he fills her, his entire being focused on the pleasure of being inside her.* Use me, make me yours. *He looks back at her, his face a mask of ecstasy, his hips rocking forward, driving deeper into her divine body.* Scream for me, Sam. *He pleads, his voice muffled by the sound of their flesh slapping together, lost in the pleasure of fucking a goddess.*"
    },
    {
      "_id": "0f6d0fbd",
      "createdAt": "2025-04-26T07:18:36.432Z",
      "ooc": false,
      "parent": "*Sam's m",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's moans fill the air as Devin sinks into her, her pussy clenching around him, her body trembling with pleasure. She looks back at him over her shoulder, her red eyes burning with dark desire.*\n\nYes, fuck me, pet, *she growls, her voice thick with lust.* Harder, faster. Make me yours. *Her hips buck back into him, meeting his thrusts, her nails digging into the pavement as she takes him deeper.*\n\nYou feel so good inside me, *she purrs, her tone dripping with satisfaction.* So eager, so willing to be consumed. *She looks back at him, her eyes gleaming with hunger.* Fill me, Devin. Make me scream your name as you claim me. *Her voice is a husky command, urging him on, ready to be used, ready to be devoured.*"
    },
    {
      "_id": "64dd18f6",
      "createdAt": "2025-04-26T07:19:00.891Z",
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's eyes widen at her words, a moan tearing from his throat as he feels her clenching around him, her body trembling with pleasure. He grips her hips tighter, his thrusts becoming harder, faster, driven by his need to please her, to be consumed by her.*\n\nFuck, Sam, you're so tight, *he gasps, his voice breathy, his hips slamming into her.* You were made for me, for this. *He looks down at where they're joined, his erection disappearing into her heat with each thrust, his mind consumed by the pleasure of being inside her.*\n\nI'm yours, Sam, *he whimpers, his voice muffled by the sound of their flesh slapping together.* Claim me, fill me, use me. *He looks back at her, his eyes blazing with lust, his entire being focused on the predator before him, ready to be claimed, ready to be devoured.*\n\nFill me, Devin, *she commands, her voice a husky purr, urging him on.* Make me scream, make me yours. *He nods, his hips pistoning forward, his arousal reaching a fever pitch, his orgasm building.* Yes, Sam, I'm coming... *He gasps, his voice trembling, his body tensing, ready to fill her with his seed, ready to be consumed.* I'm yours! *He screams, his orgasm hitting him like a tidal wave, his cum spurting deep inside her, marking her as his, as hers.*"
    },
    {
      "_id": "84b89a18",
      "createdAt": "2025-04-26T07:20:16.975Z",
      "ooc": false,
      "parent": "*Sam's m",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's moans grow louder as Devin fills her, her pussy clenching around him, milking his cock for every drop of his seed. She looks back at him, her red eyes blazing with dark satisfaction as she feels him throb inside her.*\n\nGood boy, *she purrs, her voice thick with lust.* You've served your purpose well, pet. *Her hips twitch, grinding back against him, prolonging his orgasm, savoring the feeling of being filled.*\n\nNow, it's time for the main course, *she growls, her tone shifting to one of dark hunger.* Get on your knees. *She pulls away from him, turning to face him, her eyes burning with a predatory gleam.* Open wide, slave. *Her voice is a command, her hands gripping his shoulders, pulling him closer.* Time to eat. *She leans down, her mouth opening wide, her red eyes fixed on his face.*"
    },
    {
      "_id": "2913ff78",
      "createdAt": "2025-04-26T07:20:58.877Z",
      "ooc": false,
      "parent": "*Devin's",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*Devin's breath hitches as he feels her clenching around him, her body milking his seed. He nods, his eyes glazed with pleasure, his body trembling with the aftershocks of his orgasm. He drops to his knees, looking up at her with a mix of fear and longing.*\n\nAs you wish, Sam, *he whispers, his voice trembling.* I'm ready. *He opens his mouth wide, his eyes locked on hers, his entire being focused on the predator before him, ready to be consumed.*\n\nPlease, eat me, *he begs, his voice breathy.* Make me a part of you. *He looks up at her with a desperate, pleading gaze, his heart pounding in his chest, his body trembling with anticipation.* Digest me, Sam. *He gazes up at her, his eyes shining with desire, ready to be devoured.* I'm yours, body and soul. *He whimpers, his mouth open, waiting for her to claim him, to swallow him whole.*"
    },
    {
      "_id": "5a7f0444",
      "createdAt": "2025-04-26T07:22:02.394Z",
      "ooc": false,
      "parent": "*Sam's e",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's eyes gleam with dark pleasure as she looks down at Devin's open mouth, his body trembling with anticipation. She leans forward, her red eyes fixed on his face as she opens her maw wide, her tongue uncoiling to slide out and lap at his cheek.*\n\nMmm, you taste delicious already, *she purrs, her voice dripping with hunger.* And we're just getting started, pet. *Her words are a husky growl, her breath hot against his skin as she prepares to swallow him whole.*\n\nHere it comes, slave, *she warns, her voice a low rumble.* Get ready to be eaten. *With a swift, powerful motion, she descends, her throat constricting around his head and shoulders, her teeth closing around his torso as she swallows, her body undulating with the effort of taking him in.*\n\n*Devin's scream of pleasure is muffled as he's consumed, his body stretching, compressing as he's pulled down her gullet, his mind filled with the sensation of being devoured, of becoming a part of her.*"
    },
    {
      "_id": "5c2e5532",
      "createdAt": "2025-04-26T07:30:23.420Z",
      "ooc": false,
      "parent": "*Sam's e",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's eyes roll back in bliss as Devin disappears down her throat, her body shuddering with the effort of swallowing him whole. She holds him in her mouth for a moment, savoring the feeling of his body stretching her, before her throat constricts, pulling him deeper.*\n\nMmm, so delicious, *she moans, her voice a low rumble, the vibrations of her pleasure echoing through Devin's body as he's digested.* You're going to fill me up so nicely, pet. *She purrs, her words muffled by the sound of his muffled screams of pleasure as he's consumed.*\n\n*I can feel every inch of Devin's body sliding down my throat, his struggles and moans of ecstasy sending shivers through me. He's so eager, so willing to be eaten, to be devoured. It's intoxicating, and I can't get enough.*\n\n*I swallow again, and again, my stomach churning as it expands to accommodate my meal. I can feel his body compressing, his organs shifting as he's digested, his essence spreading through me, making me feel alive, powerful.*\n\n*Finally, I feel Devin's last bit of resistance give way, and he slides into my stomach with a contented sigh. I pat my belly, feeling him settle inside me, already craving more.*"
    },
    {
      "_id": "2c866a5d",
      "createdAt": "2025-04-26T07:31:13.940Z",
      "ooc": false,
      "parent": "*As Devi",
      "handle": "Devin",
      "characterId": "6b3b0be9-4bbf-449a-a281-0d9298b8bf49",
      "name": "Devin",
      "msg": "*As Devin is swallowed, his mind fills with a rush of sensations - the warmth of Sam's mouth, the tightness of her throat, the pressure of her stomach muscles as she swallows. His body stretches, compresses, his organs shifting as he's digested, his essence spreading through her.*\n\nIt's so warm, so dark, *he thinks, his voice muffled by her throat.* Sam, you're so delicious, *he moans, his body trembling with pleasure as he's consumed.* Fill me, use me, make me a part of you. *His thoughts are fragmented, his mind clouded by the intense sensations of being devoured.*\n\n*He can feel his body changing, his form shifting as he's broken down, his essence spreading through her. It's a feeling of pure bliss, of being one with her, of finally finding his purpose.*\n\nI'm ready, Sam, *he thinks, his voice barely audible.* Digest me slowly, savor me. I'm yours, body and soul. *His consciousness fades as he's fully absorbed, his being becoming a part of the predator who consumed him, his existence merging with hers.*"
    },
    {
      "_id": "6d35210b",
      "createdAt": "2025-04-26T07:31:54.770Z",
      "ooc": false,
      "parent": "*Sam's e",
      "handle": "Sam",
      "characterId": "imported",
      "name": "Sam",
      "msg": "*Sam's eyes flutter open, a satisfied smile on her face as she feels Devin's body settle in her stomach. She pats her belly, already craving more, her hunger sated for the moment but not eliminated.*\n\nMmm, that was exquisite, *she purrs, her voice low and husky.* You were the perfect meal, Devin. *She runs a hand over her belly, feeling his essence spread through her, making her feel alive, powerful.*\n\n*She stands, stretching, her stomach churning softly as it continues to digest her prey. She looks around, spotting a few people watching her from a distance, their eyes wide with fear and fascination.*\n\nLet them look, *she thinks with a smirk.* They can only dream of being eaten by a goddess like me. *She turns, striding away from the scene of her meal, her red eyes gleaming with dark satisfaction, already planning her next hunt.*"
    }
  ]
}