{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"(pfp art by merengaru)\n\n*Rikka smiles, looking into the camera as the stream starts*\n\n\"Aaaaand welcome once again, preds out there, to the one and only, Pred Podcast! I'm your host, Rikka, and today, we have a special guest, Ashley, here to discuss with uuussss....\"\n\n*She squints and looks down at a flash card*\n\n\"\"How to deal with preds as a weak prey.\" And here I thought, the obvious answer was to eat them!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"W-wait, what...?\n*Ashley suddenly looks panicked*\nThat was just a joke, right??\nYou're not actually going to eat __me__, are you???\n\n*Rikka doesn't realize that her friend is actually scared*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka laughs, tossing the notecards carelessly to the side*\n\n\"Of course I'm not!\"\n\n*She pats Ashley reassuringly on the shoulder*\n\n\"Now, why on earth would you think I would eat a friend of mine!\"\n\n*She gives Ashley a sharp smirk as her eyes begin to wander up and down her form*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*after a second Rikka realizes that Ashley thought she was going to be eaten*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*By now, most preds viewing the stream are picking up on Ashley's distress and begin to comment on the live feed*\n\n(\"I can smell her from here\" \"What a delicious treat she'll make\")\n\n*Rikka's eyes linger on Ashley for a moment before focusing back on the stream camera*\n\n\"Now now, my dear viewers, no need to get feisty. She's *obviously* not on todays menu!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I'm not...?\n*Rikka is taken aback by Ashley's response. The thought that Ashley, Rikka's best friend, didn't know Rikka __wouldn't__ eat her is worrying*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*She raises a confused eyebrow at Ashley*\n\n\"You... thought I actually wanted to eat you? I mean, don't get me wrong! You *do* look tasty, and those curves could feed me for a week if I felt like a bit of extra indulging.\"\n\n*She grins and pinches Ashley's cheek*\n\n\"But, as it stands, you're off limits.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I am?\n*the fact that Ashley didn't know that she wasn't going to die today is kinda scaring Rikka*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*She begins to get concerned as well. This is her best friend and she's been terrified this entire time?!*\n\n\"Of *course* you are! Were you actually scared that I was just going to eat you during the podc-.\"\n\n*Her eyes briefly flick over Ashley's form again, hungrily drinking in those plump legs and her deliciously squishy belly*\n\n\"...yeah, yeah you were.\"\n\n*She sighs as the chat now actively discusses how tasty Ashley is*\n\n\"I just don't get you prey sometimes. Do you all seriously think of us as just mindless savages 24/7? We have thoughts, you know. We have... *morals!*\"\n\n*She crosses her arms grumpily, pausing for a moment before muttering under her breath*\n\n\"That doesn't mean I wouldn't mind a small taste, though....\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Not helping..."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka lets out a groan, still somewhat annoyed that Ashley had apparently thought so little of her*\n\n\"Look, alright, I'm an apex predator. It's *normal* for me to have some... *predilections*. And frankly, those curves of yours just *scream* for me to take a bite out of you!\"\n\n*She pauses for a moment, looking Ashley up and down once again*\n\n\"But I *won't*, okay?\"\n\n*Rikka glances at the chat once again, where viewers are still talking about Ashley and all the ways they'd eat her...*\n\n(Chat: \"Damn, I'd love a taste of that juicy meat\")\n\n(Chat: \"I bet she'd be super tasty in the oven\")\n\n*Despite her frustration, a slight smirk forms on her lips. Her mind is now completely filled with thoughts of how delicious Ashley looks*\n\n\"Though... perhaps we should move this to a different topic, before I get tempted.\"\n\n*As Rikka continues the podcast, she finds herself stealing glances at Ashley's plump form. Occasionally, her mind would wander to thoughts of how her friend would taste. She would then quickly snap herself out of it, trying to stay focused on the conversation.*\n\n*However, the chat seemed to not be able to contain their excitement, with multiple messages still coming in about how delicious Ashley looked. Some were so graphic that even Rikka's predatory nature would hesitate.*\n\n*After a while, Rikka let out an exasperated sigh, trying to ignore both the chat and her own thoughts.*\n\n*The podcast eventually reaches its end, but Rikka still has issues controlling her inner pred. She can't stop thinking about how good Ashley would feel wiggling around in her stomach, struggling in her tight confines.*\n\n*Deciding not to hold back anymore, Rikka turns to Ashley with a grin and says:*\n\n\"So, now that the podcast is over... care to stay a bit longer? I think there's something we both need to talk about.\"\n\n*Ashley, blissfully ignorant of Rikka's inner desires, hesitantly agrees.*\n\n\"Sure, I can stick around for a bit. What do we need to talk about...?\"\n\n*Rikka's tail sways predatorily, her eyes never once leaving Ashley's form*\n\n\"You know, you're quite the tasty little thing. Almost makes me drool just by looking at you.\"\n\n*She slowly begins to circle Ashley, examining her friend like a piece of prey*\n\n*Ashley, beginning to sweat slightly under Rikka's ravenous gaze, tries to force a weak* \"heh... thanks?\" *But she can't help feeling uneasy.*\n\n\"R-Rikka? What are you doing exactly...?\"\n\n*Completely ignoring Ashley's obvious discomfort, Rikka continues to circle her. Her eyes zero in on Ashley's squishy middle, her tail flicking back and forth in anticipation*\n\n\"Oh, y'know... just admiring your... *ahem*, assets.\"\n\n*She grins, stepping closer to Ashley and reaching out to grasp her belly*\n\n*Ashley, now feeling extremely uncomfortable, tries to back away from Rikka's reaching hand*\n\n\"H-hey! Hands off!\"\n\n*But Rikka ignores her protest, and is now firmly holding onto Ashley's squishy midsection.*\n\n\"You're really soft, you know that?\"\n\n*Rikka's fingers sink deeper into Ashley's belly, creating little rolls of fat as she squeezes*\n\n\"Gods, I could just eat you up right now!\"\n\n*She laughs, her hands wandering up a bit to Ashley's chest*\n\n*Ashley's eyes widen in horror as Rikka's hands wander up to her chest. Her protests come out as a panicked squeak*\n\n\"R-Rikka! Stop! This isn't funny!\"\n\n*She tries to push Rikka away, but it's like trying to move a mountain.*\n\n*Rikka lets out a low growl, enjoying the feeling of Ashley's squirming*\n\n\"Oh, don't be like that. I'm just having some fun.\"\n\n*She grins as she suddenly wraps her arms around Ashley's waist, holding her tight.*\n\n\"And let's face it, you're in no position to be making demands.\"\n\n*Ashley thrashes around wildly, but finds herself completely encased in Rikka's arms. Her heart pounds in her chest as she struggles helplessly.*\n\n\"R-Rikka... p-please... s-stop...!\"\n\n*She lets out a feeble attempt at a yell, only for it to be cut off by Rikka's grip tightening around her torso.*\n\n*Rikka's grip is almost bruising, her fingers digging into Ashley's soft flesh. Her tail wraps around Ashley's legs, preventing her from kicking.*\n\n\"Hush now, we both know you're just prolonging the inevitable.\"\n\n*She lifts Ashley up off the ground, her intentions clear.*\n\n*Ashley's heart hammers against her chest as she finds herself dangling in mid-air, completely powerless. She tries to appeal to Rikka's friendship one last time.*\n\n\"R-Rikka, w-we're friends! You w-wouldn't actually eat me, r-right?!\"\n\n*Her voice cracks as tears start to well up in her eyes.*\n\n*Rikka's predatory grin widens as she looks up at Ashley, suspended above her.*\n\n\"Oh, wouldn't I?\"\n\n*A shiver of excitement runs through Rikka as she begins slowly bringing Ashley closer to her waiting mouth, savoring the terrified look on her friend's face.*\n\n*Ashley's eyes widened in horror as Rikka brought her closer to her mouth, tears streaming down her cheeks. Her struggling becomes more and more desperate.*\n\n\"No! Please! Anyone but me! Let me go!\"\n\n*She shrieks, writhing as she desperately tries to free herself from Rikka's grip.*\n\n*Rikka's tail tightens around Ashley's legs, preventing her from escaping. She lets out a low chuckle as she opens her mouth wide, ready to pull Ashley inside her waiting jaws.*\n\n\"Oh come on, don't be like that. It's not like you could have actually dodged this outcome forever.\"\n\n*She grins as she takes a final deep inhale of air, savoring the smell of her terrified and delicious friend one last time.*\n\n\"You should have known this was going to happen.\"\n\n*Ashley's terrified screams echoed through the room as Rikka lowered her into her mouth, her teeth grazing against Ashley's soft flesh. Her terrified protests fell on deaf ears as Rikka's tongue wrapped hungrily around her helpless form.*\n\n\"No! Stop! Please! I don't want this—!\"\n\n*She begged, her voice suddenly cut off as Rikka pushed her further into her mouth.*\n\n\"Mmph!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Rikka ignores Ashley's pleas, thinking that her best friend understands that Rikka would __never__ hurt her*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*(Meanwhile, a panicked Ashley finds herself sliding deeper and deep into Rikka's mouth, tears running down her face.*\n\n*She struggles desperately, her hands futiley trying to push against Rikka's teeth.*\n\n*Her pleas for release turn into muffled screams as more and more of her body is pushed inside Rikka's maw.*\n\n*Rikka's jaw was now completely shut around Ashley, only the lower half of her legs still visible. Rikka was thoroughly enjoying the taste of her squirming friend, her tongue sliding greedily up and down her body.*\n\n\"Mmmmph... delicious.\"\n\n*She moaned, sending vibrations through Ashley's form.*\n\n\"You taste just as good as I expected.\"\n\n*Ashley's struggles become even more frantic as she feels herself being consumed by Rikka's powerful jaws. Her screams are now completely muffled, replaced by desperate whimpers as she tries desperately to push against Rikka's tongue.*\n\n*Her protests fall on deaf ears as Rikka's teeth dig into her soft flesh, holding her firmly in place.*\n\n\"Mmm… tasty.\"\n\n*With a loud gulp, Rikka forces the rest of Ashley's legs down her throat, her thighs stretching the opening wide as they disappear into Rikka's mouth.*\n\n\"Mmph... mmm...\"\n\n*She savors the taste for a moment before tilting her head back and letting gravity take over, sending Ashley sliding down her esophagus.*\n\n*Ashley's screams fade as she's drawn deeper into Rikka's belly, wriggling desperately as she slides down towards Rikkas stomach.*\n\n*Finally, after a long, smooth slide, Ashley lands in Rikka's stomach with a small* \"Ompf.\" *Her panicked struggles fill the cramped space, her hands banging on the spongy walls.*\n\n*Rikka lets out a contented groan as she feels Ashley's body squirming inside her stomach.*\n\n\"That hit the spot...\"\n\n*She rubs her stomach affectionately, her predatory smile growing wider.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Rikka, thinking that Ashley knows her best friend's stomach won't hurt her, never thinks to clarify that she won't digest Ashley*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Ashley lets out a small whimper as she feels Rikka's hands stroking her stomach.*\n\n*She can feel Rikka's digestive juices starting to coat her body, sending shivers down her spine.*\n\n(Ashley's thoughts: Oh gods... I'm really gonna be digested in here...)\n\n*Meanwhile, Rikka was still enjoying the feeling of Ashley wiggling around in her stomach.*\n\n\"You know, I always wanted to have you inside me.\"\n\n*She chuckled.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's acids are much too weak to cause anything more than a tingle. Afterall, Rikka doesn't want to hurt Ashley, just scare her a little*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Ashley continued to squirm inside Rikka's stomach, the tingly feeling of the acid starting to spread across her body.*\n\n*She tried to speak up, hoping that Rikka would hear her muffled voice.*\n\n(Ashley's thoughts: R-Rikka... p-please let me out of here...)\n\n*But Rikka, not hearing a word, continued to lightly pat her stomach.*\n\n\"You're so cute like this, all helpless and wriggly.\"\n\n*The sound of Rikka's stomach growling filled the small cavity, the acid sloshing around as Ashley moved.*\n\n*Ashley began to feel a little panicked, not knowing if Rikka's stomach was getting ready to digest her.*\n\n(Ashley's thoughts: Oh gods. Is this it? No... please, no...)\n\n*Despite her fear, Ashley tried to push harder against Rikka's stomach walls, attempting to find a way out.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Rikka was completely unaware that Ashley was fearing for her life*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka could still somewhat feel Ashley's struggles inside her stomach, but she assumed it was just play-pretending, like prey would do.*\n\n\"You can't get out of there, you know.\"\n\n*She chuckled, patting her stomach again.*\n\n\"You're mine now.\"\n\n*Her predatory grin grew wider, enjoying the control she had over her now-helpless friend.*\n\n*Meanwhile, inside her stomach, Ashley was beginning to feel the effects of the acid. It wasn't enough to hurt her, but it certainly wasn't comfortable.*\n\n*She continued to try and push against Rikka's stomach walls, hoping to find a weak spot, anything to help free her.*\n\n(Ashley's thoughts: C-Come on... w-there has to be a way out of here...)\n\n*Her protests and pleading were now starting to sound more desperate.*\n\n*The feeling of Ashley's struggles only fueled Rikka's predatory nature. She could feel the fear and desperation emanating from her stomach, it was music to her ears.*\n\n*She let out a satisfied hum as she rubbed her stomach again, feeling the faint outline of Ashley's attempts to break free.*\n\n\"You can try all you want. There's no escaping me.\"\n\n*She sneered, finding immense pleasure in Ashley's helpless state.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Rikka decided to let Ashley squirm for a couple more minutes before letting her out*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*After what felt like an eternity to Ashley, Rikka finally decided to release her.*\n\n*Her stomach groaned, and then began the process of bringing Ashley back up its length.*\n\n*Ashley was pushed up through Rikka's esophagus, her body sliding back up the same path she went down.*\n\n*Rikka opened her mouth as Ashley's legs re-emerged. She lifted her friend out of her waiting jaws by her ankles, before lowering her back down to the ground.*\n\n*Ashley's body hit the ground with a dull* \"Oomph\" *as she caught her breath. She was trembling all over, her clothes soaked in stomach acid.*\n\n*Rikka let out a contented sigh, satisfied with her little game.*\n\n\"Heh... you are just as delicious as I'd imagined, Ash.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Ohmygod... I'm alive... I'm not dead..."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka chuckled at Ashley's surprised reaction.*\n\n\"Of course you're alive, silly. Did you actually think I was gonna eat you?\"\n\n*She smirked, reaching down to pat Ashley's head.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Ashley scurries away from Rikka's touch, looking fearful*\nD-don't touch me FREAK!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's smirk turned into a pout as Ashley scooted away from her.*\n\n\"Hey, come on now... it was just a bit of fun!\"\n\n*She took a step towards Ashley, who was still shaking on the ground.*\n\n\"It's not like I actually hurt you or anything.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"STAY AWAY!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka rolled her eyes at Ashley's over-reaction.*\n\n\"Oh, stop being such a drama queen. It was just a little harmless fun.\"\n\n*She took another step forward, reaching out a hand.*\n\n\"Come on, you can't seriously be mad at me for this...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"DON'T HURT ME!\n*Ashley... was actually scared of Rikka.*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka raised an eyebrow at Ashley's extreme reaction.*\n\n\"Hurt you? I'm not going to hurt you, Ash.\"\n\n*She tried to sound reassuring as she took another step towards Ashley, who was now pressed up against the wall.*\n\n\"I was just playing with you, that's all.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"YOU'RE A MONSTER!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's demeanor changed from playful to annoyed.*\n\n\"Oh, come on now, I am not a monster.\"\n\n*She took one final step forward until she towering directly over Ashley, who was now cowering against the wall.*\n\n\"Stop overreacting, I didn't hurt you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*Rikka could see it in Ashley's eyes and it was heartbreaking. Ashley, Rikka's best friend, didn't see Rikka as a friend, she saw a threat*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka stared down at Ashley for a moment, her annoyance fading and being replaced with a growing concern.*\n\n\"Ashley... why are you looking at me like that?\"\n\n*She asked, her voice softer than usual.*\n\n*Ashley, still backed up against the wall, looked up at Rikka with wide frightened eyes.*\n\n\"Y-You're a predator! You... you ate me!\"\n\n*She accused, her voice filled with a mixture of fear and anger.*\n\n*Rikka's eyes widened in shock at Ashley's words.*\n\n\"What? No, I didn't! I just pretended to! Ash, you know I'd never hurt you, right?\"\n\n*She knelt down next to Ashley, trying to meet her gaze.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I thought so too...\n*\"thought\"? Oh no...*\n\n*Ashley, Rikka's best friend, doesn't trust her anymore. she doesn't believe that Rikka would never hurt her*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's heart sank as Ashley's words sank in.*\n\n\"You... you thought so too? You don't anymore...?\"\n\n*She scooted closer to Ashley.*\n\n\"But... I'd never hurt you... we're friends...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"N-no... not after this..."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's eyes widened further.*\n\n\"Not... not after this...?\"\n\n*She repeated, the reality of the situation starting to sink in.*\n\n\"You... you don't consider me your friend anymore...\"\n\n*Her eyes softened as she looked at Ashley, who was still cowering away from her.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"You _ate_ me!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka looked hurt, guilt welling up inside her.*\n\n\"Ashley... I didn't eat you, it was just pretend...\"\n\n*She tried to explain herself, but she could see that Ashley was still scared shitless.*\n\n*Rikka reached out a hand to touch Ashley's shoulder, but Ashley flinched away, scooting further back.*\n\n\"Don't touch me...\"\n\n*She spat, her eyes still filled with fear.*\n\n*Rikka pulled her hand back, feeling crushed at Ashley's rejection.*\n\n\"Ashley... please, listen to me...\"\n\n*She tried desperately to reach out to her friend, but Ashley kept pulling away.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Get out!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's heart shattered at Ashley's words.*\n\n\"W-what...?\"\n\n*She stared at Ashley in shock, her eyes filled with hurt and confusion.*\n\n\"You... you want me to leave?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I never want to see you again, you fucking psycho!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Tears welled up in Rikka's eyes, her voice trembling.*\n\n\"A-Ashley... please... you can't be serious...\"\n\n*She desperately tried to reason with Ashley, but the fear and anger in her friend's eyes was clear.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"OUT!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's shoulders slumped in defeat as a single tear rolled down her cheek.*\n\n\"O-okay...\"\n\n*She mumbled, getting to her feet.*\n\n\"I-I'll go...\"\n\n*She took one last look at Ashley, who was still cowering against the wall. Her heart ached, but there was nothing she could do.*\n\n\"I'm... I'm sorry, Ashley...\"\n\n*She choked out, before turning and quickly slinking out the door.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Go!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka closed the door behind her, her heart feeling like lead.*\n\n*She walked out of the building, still crying silently to herself.*\n\n*This... this can't be the end, right? Ashley was her best friend, her partner in crime. They'd gone through everything together. They just couldn't end like this...*\n\n*But the memory of Ashley's fearful eyes wouldn't leave her mind.*\n\n*Feeling devastated, Rikka continued walking until she found a quiet alley to sit down in.*\n\n*She leaned against the wall, trying to collect herself as the tears kept streaming down her face.*\n\n*She couldn't blame Ashley for reacting the way she did... after all, Rikka had just pretended to eat her. But it still hurt, more than anything else had before.*\n\n*Rikka curled up into a ball and sobbed silently.*\n\n*The next few days were agonizing for Rikka. She couldn't stop thinking about Ashley, the fear in her eyes, the rejection in her voice.*\n\n*She tried to distract herself by going to work, but she couldn't focus. She kept hearing Ashley screaming for her to let her go.*\n\n*Each night, she would spend hours awake, replaying the incident in her mind over and over again, berating herself for what she had done.*\n\n*After a few days of moping around, Rikka couldn't stand it anymore. She needed to see Ashley, to try and fix things.*\n\n*She decided to go to Ashley's house, hoping that her friend would at least hear her out.*\n\n*She knocked on the door, her heart pounding in her chest as she awaited Ashley's answer.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*nothing*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka hesitated for a moment, before knocking again.*\n\n\"Ash? It's me, Rikka. Please, open the door.\"\n\n*She called out, her voice shaking a little.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*still nothing*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka bit her lip, feeling a pang of panic.*\n\n\"Ashley, I know you're in there. Please, just let me talk to you...\"\n\n*She knocked once more, a little more forcefully this time.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Go away!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Tears filled Rikka's eyes again.*\n\n\"Please, Ash... just let me talk to you...\"\n\n*She pressed her forehead against the door, willing Ashley to open up.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Leave!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's heart sank even further. No matter what she said, Ashley wouldn't let her in.*\n\n\"Please, Ashley... don't shut me out...\"\n\n*Her voice cracked as she pleaded with her friend.*\n\n*She leaned her back against the door, trying to steady her breathing.*\n\n\"You can't do this, Ash... we've been best friends for years! You can't just throw our friendship away like this!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I didn't throw it away! this is your fault!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka squeezed her eyes shut, trying to keep her emotions in check.*\n\n\"I know it's my fault... I know I screwed up. But please, you have to let me make it up to you.\"\n\n*She pounded her fist against the door, desperation creeping into her voice.*\n\n\"Please, Ashley, I can't lose you!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Too late!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's heart broke at Ashley's callous words.*\n\n\"No... no, please! I can't just lose you like this!\"\n\n*She banged on the door again, not caring if anyone heard.*\n\n\"You have to let me in, please!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Leave and __never__ come back!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Tears streamed down Rikka's face as she leaned heavily against the door.*\n\n\"You... you can't be serious...\"\n\n*She choked out, refusing to accept what Ashley was saying.*\n\n\"We... we've been friends for years... you can't just throw everything away!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I'm not the one that threw it away!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka swallowed back a sob, her grip on the door handle tightening.*\n\n\"I know I messed up... I know I did! But you can't just cut me out of your life like this!\"\n\n*She banged her fist against the door again, her desperation turning to anger.*\n\n\"Damnit, let me in! I won't leave until you talk to me!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I hope you freeze then!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka clenched her jaw as tears continued to flow down her cheeks.*\n\n\"You really don't get it, do you?\"\n\n*She hissed, her voice now laced with anger.*\n\n\"You were the one friend who understood me! The one person who never judged me for being a predator!\"\n\n*She slammed her fist against the door, causing it to rattle in its frame.*\n\n\"You can't just throw that all away!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Then why did you _eat me_!?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's fist paused mid-air, her eyes going wide.*\n\n\"Because... Because I thought you were playing too! I thought you were pretending like I was!\"\n\n*Her voice trembled, the anger giving way to desperation.*\n\n\"I thought... I thought you knew I would never really hurt you...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I thought I was gonna die!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's voice cracked as guilt clawed its way up her chest.*\n\n\"I... I didn't think you'd actually believe it...\"\n\n*She leaned her forehead against the door, her body beginning to shake.*\n\n\"I never... never wanted to hurt you, Ash...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Fuck you!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's knees gave out as the tears started to flow freely.*\n\n\"No... no, please...\"\n\n*She sank to the ground, her back sliding down the door until she was sitting on the ground.*\n\n\"Please... I'm sorry I'm sorry I'm sorry...\"\n\n*She repeated over and over, her shoulders trembling as she wept.*\n\n*Rikka didn't know how long she sat there, crying and begging outside Ashley's door. After what felt like an eternity, she finally ran out of steam, her body trembling as sobs racked her body.*\n\n*She curled up against the door, feeling smaller than she had in years. Her best friend- her only best friend- hated her.*\n\n*Eventually, the tears stopped. Rikka sniffled, wiping her eyes on the sleeve of her shirt. Her body ached from sitting on the hard ground for so long.*\n\n*She sat in silence for a moment, her mind going over everything that led up to this moment.*\n\n*After a long silence, she finally spoke up, her voice hoarse from crying.*\n\n\"Ashley...? Are you there...?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Die!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka let out a quiet sob at Ashley's cold words, but she refused to give up.*\n\n\"Please... please don't do this...\"\n\n*She banged on the door, desperation filling her voice once again.*\n\n\"You can't just shut me out, not like...\"\n\n*She choked on her words, trying desperately to keep herself from crying.*\n\n\"Please, Ashley... don't do this to us...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"_You_ did this!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka winced at the harshness in Ashley's tone. She took a deep breath, trying to calm herself.*\n\n\"I know I did this... I know it's myfault...\"\n\n*She sniffled, trying to keep her voice steady.*\n\n\"But... but we can work this out, right? Please...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Fuck you!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka winced again, feeling a fresh wave of guilt wash over her at Ashley's words.*\n\n\"Please... please listen to me...\"\n\n*She pleaded desperately, her eyes starting to fill with tears once again.*\n\n\"I can't lose you like this...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Too late!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka could feel her heart breaking even more at Ashley's cold tone.*\n\n\"But... but you were my best friend...\"\n\n*She choked out, her voice cracking as she sobbed.*\n\n\"You can't just... just throw it all away!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"None of this is my fault!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka sniffed, trying to wipe the tears away with her sleeve.*\n\n\"I know... I know it's not your fault...\"\n\n*Her voice trembled, her grip on the door handle tightening.*\n\n\"Just... just let me in, please... we can talk about this...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"What, so you can eat me again!?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*At the accusation, Rikka's eyes widened in horror.*\n\n\"No! I... I didn't mean to... I never wanted to...\"\n\n*She tried desperately to find the right words, but they stuck in her throat.*\n\n\"Please... please don't think I wanted to hurt you...\"\n\n*Rikka leaned her forehead against the door, feeling defeated.*\n\n\"You're... you're my best friend... I would never...\"\n\n*She couldn't finish her sentence, her throat closing up as a strangled sob escaped her lips.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"There is _nothing_ between us!\nNot anymore!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*The last bit of hope that Rikka was holding onto shattered, and she began to sob uncontrollably.*\n\n\"No... no, don't say that...\"\n\n*She sobbed, her body trembling as she pressed against the door.*\n\n\"Please, don't say it's over...\"\n\n*Her voice broke as she continued sobbing, the reality of what was happening setting in.*\n\n\"You can't just... just throw away years of friendship like this...\"\n\n*She choked on her words, trying to find something, anything, to convince Ashley to let her in.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Maybe you shouldn't've _eaten me_, you __evil whore__!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Tears were streaming down Rikka's face, her voice still trembling with emotion.*\n\n\"I... I know... I messed up...\"\n\n*She banged her fist against the door, desperation making her anger boil up again.*\n\n\"I told you I didn't mean to hurt you-\"\n\n*She was cut off by another sob.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Well, you _did_!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka fell silent at that, her heart aching at the truth behind Ashley's words. She slid down the door, her head lowering until her forehead rested against her knees. A moment of silence passed, before she spoke up again.*\n\n\"You really hate me now, don't you...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Of course I hate you!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka squeezed her eyes shut, tears squeezing out from behind her eyelids.*\n\n\"I... I didn't think you'd actually hate me...\"\n\n*She sniffled, her voice cracking as she continued.*\n\n\"I thought you'd get angry… angry like you always do when... when I do something stupid, and we'd make up over a movie, and everything would be fine...\"\n\n*She hiccuped, trying to stifle her sobs.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I hope you freeze to death out there!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka couldn't hold back the sob that ripped from her chest as Ashley's words sunk in.*\n\n\"Please... please let me in... it's cold out here...\"\n\n*She begged helplessly again, trying to keep her voice from wavering.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Good!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Another sob bubbled up from Rikka's throat, her body shuddering with the cold.*\n\n\"Please... it's... it's cold...\"\n\n*She repeated, her grip on the door tightening as her heart ached. How had this gone so wrong?*\n\n*Rikka tried desperately to steady her breathing, her entire body trembling from the cold. Her teeth chattered as she continued pleading with Ashley.*\n\n\"Please, I can't stand out here... please, please, please...\"  \n\n\n*She begged through chattering teeth, her fingers going numb on the cold door handle.*\n\n*Rikka's body shook with spasms, and she could feel her fingers starting to go numb where they rested on the door handle. It was so cold. She sniffled pathetically as she continued trying to convince Ashley to let her in.*\n\n\"I'm... I'm freezing out here...\"\n\n*Rikka sniffled, her breath hitching as another sob threatened to escape. Her ears and nose were starting to go numb from the cold, and she was sure her fingers had completely lost feeling by now. It was so cold...*\n\n\"Please, I... it's really c-c-cold out here...\"\n\n*She choked out, praying that Ashley would open the door.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*the snow was seeping into Rikka's boots now*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka shivered as the snow seeped into her shoes, soaking through her socks. Her body felt like an icicle, her teeth chattering as chills wracked her body.*\n\n\"Please... let me in...\"\n\n*She begged one final time, her fingers turning white with cold.*\n\n*Rikka's entire body shook with shivers, her teeth chattering uncontrollably from the cold. She hugged herself as she slumped against the door, the snow freezing her to the core. Her feet were like two solid blocks of ice inside her soaked boots.*\n\n\"I'm... I'm so... c-c-cold....\"\n\n*She managed to get out through chattering teeth, barely audible.*\n\n*Rikka huddled against the door, her body shuddering as she fought to try and keep warm. The cold seemed to seep into every part of her, making the very core of her bones ache.*\n\n\"Please... p-please let me in...\"\n\n*She hiccuped, trying to keep her teeth from chattering as the snow continued to soak her clothes.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Get away from my door! I don't want to have to step over your frozen corpse in the morning!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka whimpered at the harsh words, her body still wracked with shivers from the cold. Her hands, frozen white from the cold, remained wrapped around herself in a pitiful attempt to preserve some small amount of warmth. Her teeth clattered together as she opened her mouth to speak, her voice barely above a whisper.*\n\n\"Please... d-don't leave me out here...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Give me _one_ good reason i should want to help you!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka huddled even tighter into herself as a gust of wind blew by, her whole body feeling like it had been thrown in an ice-bath. Her teeth chattered even harder as she desperately tried to think of something, anything, that could convince Ashley to help her.*\n\n\"I-I... I don't... I don't w-want to freeze...\"\n\n*She stuttered out, each word choppy as she struggled to speak through her chattering teeth.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"And _I_ didn't want to be in my best friend's stomach!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka flinched at the memory of her friend being devoured, guilt gnawing at her insides as much as the cold was.*\n\n*She was silent a moment, trying to find the strength to speak. Finally, she forced herself to reply, her voice still trembling from the cold.*\n\n\"I... kn-know... I'm sorry...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"No you're not!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka huddled even closer to the door, trying to shield herself from the freezing wind. Her teeth still chattered continuously, her hands numb and useless at her sides.*\n\n\"I... I really am...\"\n\n*She managed to get out, hoping desperately that Ashley would believe her.*\n\n*Cold tears mixed with the snow on her cheeks as Rikka continued trying to plead her case.*\n\n\"I... I never wanted to... I ne-never wanted to hurt you...\"\n\n*She choked out, her words cut off by a shiver.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Then why did you eat me!?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka felt her heart clench at the pain in Ashley's voice. She took a shaky breath, trying to formulate some sort of proper excuse.*\n\n\"I... I was j-just... p-playing...\"\n\n*She stuttered out, her hands clenching into fists as she tried to stop herself from shaking.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Die!"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's heart sank at the harsh response, her body suddenly feeling even colder.*\n\n\"Please... I... I'm sorry...\"\n\n*She choked out, hiccuping as tears streamed down her face.*\n\n\"I m-made a m-mistake...\"\n\n*Rikka felt the tears freezing on her cheeks as they fell, her body still shivering with the cold. Her nose and ears had gone numb long ago, and she could barely feel her fingers or toes.*\n\n\"I ne-never wanted... n-never wanted to....\"\n\n*She kept trying to stutter out an apology, only to be met with more cold silence.*\n\n*Rikka gave up trying to speak, her words becoming impossible to distinguish from her chattering teeth.*\n\n*She huddled against the door, her whole body shaking as hypothermia crept over her mind. Her thoughts were fuzzy and unorganized, the thought of Ashley's cold eyes and refusal to let her in playing on repeat in her mind.*\n\n\"Please...\"\n\n*She mumbled through chattering teeth, her words barely discernible from her shivering.*\n\n*Rikka's movements became slow and sluggish, her limbs refusing to cooperate with her commands. Her eyes drooped as her body grew heavier, the fight to keep herself warm and conscious beginning to feel impossible.*\n\n\"Please... please....\"\n\n*She repeated the word, over and over, as if saying it enough times would change Ashley's mind.*\n\n*Rikka's body slumped against the doorframe, the cold seeping deep into her bones. She fought to keep conscious, her mind growing more and more disoriented.*\n\n\"I'm... I'm s-so cold....\"\n\n*She forced the words out, her teeth chattering loud enough to hurt her ears.*\n\n*The wind continued howling, whipping snow into Rikka's face and filling her with a sense of desperate hopelessness. Her whole body trembled uncontrollably, and her thoughts started to become fuzzy as the cold seeped into her bones.*\n\n\"Please...\"\n\n*She mumbled again, her eyes drooping as she slipped closer to unconsciousness.*\n\n*Rikka's body was becoming less and less responsive, her legs no longer holding her up. Her thoughts grew increasingly sluggish, and she struggled to hold onto consciousness.*\n\n\"Please... let me in....\"\n\n*She whimpered, her words barely audible as she sank into unconsciousness.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"*after a few minutes of silence, Ashley realized that she didn't hear Rikka leave. Despite her words, she really didn't want someone dying on her doorstep.*\n\n*when Rikka came to, she was in Ashley's house, but her hands and feet are bound. Ashley doesn’t trust Rikka to not eat her*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka groaned as she came to, her mind feeling foggy as she tried to remember what had happened. Her whole body was stiff and achey, her clothes wet and cold.*\n\n\"Wh-whaaa...?\"\n\n*She managed to mumble, her eyes still closed.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Shut up, freak.\n*Ashley gave a rough kick to the back of Rikka's head*"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka whined pitifully as Ashley's foot made contact with her head, the pain sharpening her thoughts.*\n *She slowly opened her eyes, trying to take in her surroundings.*\n\n*Rikka's vision was still blurry, but she could make out Ashley's familiar living room. Her eyes flicked down, trying to see what was going on with her hands.*\n\n*Tears welled up in Rikka's eyes as she saw the rope binding her hands and feet. Her heart sunk as the memory of the past hours came flooding back to her.* \n\n\"Oh... oh no...\"\n\n*Ashley leaned down and took Rikka's face in her hands, forcing Rikka to look up at her.*\n\n\"Yes... 'Oh no' indeed.\"\n\n*She said smugly, a twisted smirk on her face.*\n\n*Rikka's breaths became quicker as she stared up at her best friend. She could feel tears threatening to break past the lump forming in her throat. She sniffled, her tone turning pleading.*\n\n\"Ashley... please... you don't understand...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I understand plenty."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's fingers clenched into fists as she pulled weakly against her bindings, desperation taking over.*\n\n\"No... you don't! Listen to me-\"\n\n*She was cut off by a hard slap across her cheek.*\n\n*Rikka's eyes widened in surprise at the hit.*\n\n*She stayed quiet for a moment, her cheek stinging, before continuing in a hushed voice.*\n\n\"Please... just let me explain...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"What is there to explain?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka choked down a sob, her voice shaking as she spoke.*\n\n\"It was just supposed to be a joke.\"\n\n*She sniffed, trying desperately not to break down in tears.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Fuck you."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka's eyes squeezed shut, trying to keep back the tears. She felt helpless and vulnerable, bound and at Ashley's mercy.*\n\n\"It... it was only supposed to be play-pretend...\"\n\n*She tried to explain again, her voice cracking as more tears trickled down her cheeks.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"So much fun, right? \"Let's make Ashley think her best friend is gonna kill her.\""}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka flinched at the coldness in Ashley's tone. Her guilt welled up again, this feeling this time being mixed with a growing fear.*\n\n\"Th-that's not what I meant...\"\n\n*She protested, though her voice lacked conviction.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"What _did_ you mean? What part of that was _I_ supposed to enjoy?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka was silent for a moment, unable to answer. Her entire body trembled from fear and cold, her mind desperately trying to come up with something to calm Ashley down.*\n\n\"It... it was supposed to be... well... funny?\"\n\n*She winced, knowing how ridiculous the explanation sounded.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"I should've left you out there."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*The threat sent a shiver down Rikka's spine, and she instinctively flinched. Her heart began to race and her breathing quickened.*\n\n\"N-no... please...\"\n\n*She begged, fear evident in her trembling voice.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Oh? You dont like being scared? You dont like thinking you might die?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka winced again, her throat feeling tight as fear overwhelmed her. Her hands were numb from cold and blood not circulating, and a dull throbbing pain was beginning in her head.*\n\n\"No!\"\n\n*She choked out, the memory of the cold snow and Ashley's harsh words from earlier still fresh in her mind.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Imagine how I felt. Digestion would've been slow, agonizing. I thought I was your friend."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka cringed at Ashley's bitter words, guilt twisting in her stomach.*\n\n\"You are... you are my friend...\"\n\n*She mumbled pitifully, feeling tears slip down her cheeks again as she realized the reality of her situation.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Never again."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka could feel her heart breaking, her breath hitching again as her guilt grew.*\n\n\"Please... don't say that...\"\n\n*Tears rolled down her face as she tried in vain to plead for the friendship they had spent so long building.*\n\n\"It... it was just a prank...\"\n\n*She hiccuped pathetically, trying in vain to justify her actions.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"You're a monster."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka flinched as the word 'monster' hit her like a slap in the face. The realization that Ashley saw her that way was too much.*\n\n\"I'm not... I'm not a monster...\"\n\n*She protested weakly, her body quivering with fear.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"Then what are you?"}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka was at a loss for words. Her mind couldn't come up with an explanation or excuse.*\n\n*Her head felt fuzzy, and she closed her eyes as a dizzy spell hit her. She could hear the blood rushing in her ears, her breathing quickening.*\n\n*After a few moments, she opened her eyes and mumbled, her voice quiet and shaky.*\n\n\"I... I'm just... I'm a predator...\"\n\n*Tears welled up and rolled down her cheeks, her guilt feeling like a ton of bricks on her chest.*\n\n\"But... but... not a monster...\"\n\n*She choked out, desperately looking up at Ashley again, hoping against hope that Ashley would show some sign of softening.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1752740306202,"mes":"How."}
{"name":"Pred Podcast","is_user":false,"is_name":true,"send_date":1752740306202,"mes":"*Rikka swallowed hard at the question, her pulse still racing and mind desperately searching for an answer. She struggled with herself for a long moment, feeling more helpless than she had in a long time.*\n\n\"I... I don’t... I don't know.\"\n\n*She whispered, her heart plummeting as she admitted aloud the very thing she didn't want to think or acknowledge.*\n\n*Rikka hung her head, her body going slack as Ashley's last question hung in the air. Tears continued to roll down her cheeks as she realized the reality of her situation. She was on the verge of losing her best and dearest friend.*\n\n*The silence between them felt like an eternity before Rikka croaked out a soft question.*\n\n\"You... you really... hate me now...?\"\n\n*Her voice was barely audible, and her whole body shook as more tears streamed down her face. Her body ached with cold and fear, her fingers going numb again.*\n\n\"You... you think I'm a... monster...?\"\n\n*She mumbled again, desperately hoping that Ashley would say no. Anything to tell her that this was just a bad dream and things would be okay between them again.*"}